[
  { "_id": "A101", "title": "Propulsion Assignment", "course": "RS101","description": "In this assignment, students will delve into the dynamic world of propulsion systems, a cornerstone of modern aerospace engineering. Through a combination of theoretical study and practical application, learners will explore the fundamental principles underlying various propulsion methods, including but not limited to jet engines, rockets, and electric propulsion. Emphasis will be placed on understanding the intricacies of each system, including thermodynamics, fluid mechanics, and combustion processes. Students will critically evaluate the advantages, limitations, and applications of different propulsion technologies in diverse aerospace contexts, from commercial airliners to space exploration vehicles. Furthermore, they will investigate emerging trends and innovations in propulsion, such as hypersonic propulsion and sustainable fuel alternatives, and assess their potential impact on future aerospace endeavors. Through research, analysis, and presentation of findings, students will gain a comprehensive understanding of propulsion systems, enabling them to contribute meaningfully to the ongoing advancement of aerospace technology. This assignment will foster critical thinking, problem-solving skills, and a deeper appreciation for the complex interplay between science, engineering, and exploration in the realm of propulsion.", "points":"150", "due_date":"2024-05-29", "available_date":"2024-05-22", "until":"2024-08-30" },
  { "_id": "A102", "title": "Combustion Analysis", "course": "RS101","description": "In this assignment, students will embark on a journey into the intricate world of combustion analysis, a fundamental aspect of chemical engineering, energy systems, and environmental science. Through a blend of theoretical study and practical experimentation, learners will unravel the underlying principles governing combustion reactions and their diverse applications. The assignment will cover a range of topics, including combustion fundamentals, thermodynamics, kinetics, pollutant formation, and combustion diagnostics. Students will explore the intricacies of combustion processes in various systems, including internal combustion engines, power plants, furnaces, and propulsion systems, examining the factors influencing efficiency, emissions, and performance. Utilizing computational tools and laboratory experiments, students will analyze combustion phenomena, studying ignition, flame propagation, and combustion stability. They will investigate the influence of operating conditions, fuel properties, and combustion chamber design on combustion performance, with a focus on optimizing efficiency and minimizing environmental impact. Through critical analysis of literature, data interpretation, and report writing, students will develop a deep understanding of combustion dynamics and their implications for energy utilization and environmental sustainability. This assignment will foster problem-solving skills, scientific inquiry, and an appreciation for the complex interplay between chemistry, thermodynamics, and engineering in the realm of combustion analysis.", "points":"250", "due_date":"2024-06-29", "available_date":"2024-06-22", "until":"2024-08-30" },
  { "_id": "A103", "title": "Nozzle Design Project", "course": "RS101","description": "In this assignment, students will immerse themselves in the cutting-edge field of nozzle design, where fluid dynamics meets engineering innovation. Tasked with creating and optimizing their own nozzle designs, learners will explore the principles of fluid flow, computational fluid dynamics (CFD), and engineering design to achieve optimal performance in various applications. The assignment will guide students through the iterative process of nozzle design, starting with a comprehensive understanding of fluid mechanics principles and nozzle functionality. Through theoretical study and hands-on simulations using CFD software, students will analyze the performance of different nozzle geometries, considering factors such as velocity profiles, pressure distributions, and flow characteristics. Drawing upon principles of optimization and design iteration, students will refine their nozzle designs to meet specific performance criteria, such as maximizing thrust, minimizing pressure losses, or achieving uniform flow distribution. They will explore the influence of parameters such as nozzle shape, throat diameter, expansion ratio, and boundary conditions on overall performance. Additionally, students will investigate practical considerations in nozzle design, including manufacturability, cost-effectiveness, and material selection. They will critically evaluate the trade-offs between performance goals and practical constraints, synthesizing their findings into comprehensive design proposals. Through this hands-on project, students will develop essential skills in engineering design, fluid dynamics analysis, and problem-solving. They will gain a deeper understanding of the complex interactions between fluid behavior and geometric design in nozzle systems, preparing them for future challenges in aerospace, mechanical engineering, and beyond.", "points":"120", "due_date":"2024-07-29", "available_date":"2024-07-22", "until":"2024-08-30" },
  { "_id": "A201", "title": "Aerodynamics Quiz", "course": "RS102","description": "In this assignment, students will explore the fascinating world of aerodynamics through hands-on experimentation and analysis. Through a series of practical exercises and theoretical study, learners will investigate the fundamental principles underlying airflow around objects, lift and drag forces, and aerodynamic performance. By engaging with concepts such as Bernoulli's principle and the boundary layer effect, students will develop a deeper understanding of how air behaves in various situations, laying the foundation for advanced studies in aerospace engineering and fluid mechanics.", "points":"100", "due_date":"2024-05-29", "available_date":"2024-05-22", "until":"2024-08-30"},
  { "_id": "A202", "title": "Flow Analysis", "course": "RS102", "description": "In this assignment, students will dive into the captivating realm of flow analysis, unraveling the mysteries of fluid behavior through theoretical study and practical application. Through simulations, experiments, and analytical techniques, learners will investigate the intricacies of fluid flow phenomena, including laminar and turbulent flows, boundary layers, and vortices. By examining real-world examples and engineering challenges, students will gain valuable insights into the principles governing fluid motion, preparing them for a deeper exploration of fluid dynamics in various engineering disciplines.", "points":"120", "due_date":"2024-06-29", "available_date":"2024-06-22", "until":"2024-08-30"},
  { "_id": "A203", "title": "Heating Analysis", "course": "RS102","description": "In this assignment, students will delve into the realm of heating analysis, examining the principles of thermal dynamics and their applications. Through theoretical exploration and practical exercises, learners will investigate heat transfer mechanisms, including conduction, convection, and radiation, to analyze thermal behavior in diverse systems. By studying real-world scenarios and engineering solutions, students will develop a comprehensive understanding of heat management, enabling them to tackle challenges in fields such as HVAC, energy systems, and materials science.", "points":"80", "due_date":"2024-07-29", "available_date":"2024-07-22", "until":"2024-08-30"},
  { "_id": "A301", "title": "Structural Design Task", "course": "RS103" ,"description": "In this assignment, students will engage in a structural design task aimed at fostering an understanding of the principles of building stability and efficiency. Through a combination of theoretical study and hands-on design exercises, learners will explore key concepts such as load analysis, material properties, and structural optimization. By applying engineering principles to real-world scenarios, students will develop the skills necessary to create robust and economical structural designs, laying the foundation for success in civil engineering and related fields.", "points":"120", "due_date":"2024-05-29", "available_date":"2024-05-22", "until":"2024-08-30"},
  { "_id": "A302", "title": "Orbital Calculations", "course": "RS103" ,"description": "In this assignment, students will embark on a journey through orbital calculations, delving into the mathematical principles that govern the motion of celestial bodies. Through a series of theoretical exercises and computational simulations, learners will explore concepts such as Kepler's laws, orbital mechanics, and trajectory optimization. By mastering the tools of orbital calculation, students will develop the skills necessary to analyze and predict the motion of satellites, spacecraft, and planetary bodies, paving the way for careers in aerospace engineering and space exploration.", "points":"87", "due_date":"2024-06-29", "available_date":"2024-06-22", "until":"2024-08-30"},
  { "_id": "A303", "title": "Systems Engineering Exam", "course": "RS103","description": "In this assignment, students will tackle a systems engineering exam designed to assess their understanding of key concepts and methodologies in the field. Through a combination of theoretical questions and practical problem-solving tasks, learners will demonstrate their ability to analyze complex systems, identify requirements, and design innovative solutions. By applying systems thinking and interdisciplinary approaches, students will showcase their proficiency in addressing real-world challenges across a range of engineering domains, preparing them for success in dynamic and evolving industries.", "points":"129", "due_date":"2024-07-29", "available_date":"2024-07-22", "until":"2024-08-30" }
]


